# CustomFieldData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomFieldData Properties
CustomFieldData Class See Also
---
The CustomFieldData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefaultRowHeightOnSheet | Identifies the default row height for this field. |
| FieldName | The name of this custom field. |
| FieldTooltip | The tooltip that will be shown in the schedule properties dialog for this custom field. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace